User_panal/stock_exchange_web_signin_testing/SiGN_IN_TESTNG-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: SiGN_IN_TESTNG-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: SiGN_IN_TESTNG-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  SiGN_IN_TESTNG-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/UserRegister)
      - clickByID(signInObject_Name)
      - typeByID(signInObject_Name): "arskan"
      - clickByID(signInObject_Name)
      - typeByID(signInObject_Name): "codeteting"
      - typeByID(signInObject_Password): "123456789"
      - clickByXPath(//input[@value='Sign In'])

  SiGN_IN_TESTNG-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Referer: 'http://localhost:33143/UserRegister'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/UserRegister/DbSignIn'
            method: POST
            label: 'http://localhost:33143/UserRegister/DbSignIn'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:33143'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
            body:
              __RequestVerificationToken: IRB1VARHGFkFQ4Q5PVeb9ruf1C8SV2lUsuuKvOzPEoGqWLI_TmEKf1NV0hf6TLzXlbHR3N21WTNGU9LrAf3WmVzNC7vFP9pnudNEEHYJ3Hg1
              signInObject.Name: codeteting
              signInObject.Password: '123456789'
          - url: 'http://localhost:33143/UserRegister'
            method: GET
            label: 'http://localhost:33143/UserRegister'
            think-time: 8426ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:4943/6ac8ea9b6fa246e9be5c6d9b27f5cb64/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAB9YGMXALxjn849k3gIY764tjjxYZftafwkGtNWLW14dQAAAAAOgAAAAAIAACAAAAA6nv5Yphv%2Fdwev%2BszRVARsUWKQNpbkeYBuncrkUXNrcTAAAACWE2tXgQYXyEVRjg7BzVEQ%2FtUhSnYakIXTS1XLuO07PvtPuZKw0rvXBTz455V11exAAAAA1I%2FNnFJCAxuzR8VyDlYjxU8q8b2G9zMz%2FC3%2FXEDQTBS94JbtBRpkOcu1a0zcWbeJKHYyYbhVjN93wosYrj61jw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FUserRegister&browserName=Chrome'
            method: POST
            label: 'http://localhost:4943/6ac8ea9b6fa246e9be5c6d9b27f5cb64/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAB9YGMXALxjn849k3gIY764tjjxYZftafwkGtNWLW14dQAAAAAOgAAAAAIAACAAAAA6nv5Yphv%2Fdwev%2BszRVARsUWKQNpbkeYBuncrkUXNrcTAAAACWE2tXgQYXyEVRjg7BzVEQ%2FtUhSnYakIXTS1XLuO07PvtPuZKw0rvXBTz455V11exAAAAA1I%2FNnFJCAxuzR8VyDlYjxU8q8b2G9zMz%2FC3%2FXEDQTBS94JbtBRpkOcu1a0zcWbeJKHYyYbhVjN93wosYrj61jw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FUserRegister&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:4943/6ac8ea9b6fa246e9be5c6d9b27f5cb64/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:4943/6ac8ea9b6fa246e9be5c6d9b27f5cb64/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/UserRegister'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1545893207989'